config/emacs/doom/config.org
#+TITLE: My configuration
#+STARTUP: content
* Introduction
This is my literate configuration for doom emacs. I barley know [[https://learnxinyminutes.com/docs/elisp/][elisp]]  and I have
mostly stolen snippets from others. This config is [[elisp:(call-interactively #'count-words)][this many]] words, lines and
characters long. Its a lot of blood sweat and tears so I hope you like it as much
as I tolerate it!

Lets get this config started!
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

** Table of Contents :TOC_3:
- [[#introduction][Introduction]]
- [[#rudimentary-configuration][Rudimentary configuration]]
  - [[#quick-fixes][Quick fixes]]
  - [[#keybinds][Keybinds]]
  - [[#hooky-hooks][Hooky hooks]]
  - [[#funky-functions][funky functions]]
- [[#packages][Packages]]
  - [[#language-edditions][Language edditions]]
    - [[#caddy][Caddy]]
    - [[#vim][vim]]
  - [[#package-edditons][Package edditons]]
    - [[#hugo-support][Hugo support]]
    - [[#dired-previews-peep-dired][dired previews (peep-dired)]]
    - [[#modeline-fun][modeline fun]]
    - [[#evil-tutor][Evil tutor]]
    - [[#discord-rich-presence][discord rich presence]]
    - [[#org-super-agenda][org super agenda]]
    - [[#elfeed-goodies][elfeed-goodies]]
    - [[#dired-drag-and-drop][dired drag and drop]]
    - [[#themes][themes]]
  - [[#outside-influence][Outside Influence]]
    - [[#tldr-integration][tldr integration]]
    - [[#atomic-chrome][atomic chrome]]
    - [[#emacs-application-framework][emacs application framework]]
    - [[#pretty-code-shots][pretty code shots]]
    - [[#matrix][matrix]]
  - [[#fun][fun!]]
    - [[#keycast][keycast]]
    - [[#selectric-mode][selectric-mode]]
    - [[#games][Games]]
    - [[#snow][snow]]
  - [[#sidebars][Sidebars]]
    - [[#dired-sidebar][Dired sidebar]]
    - [[#ibuffer-sidebar][Ibuffer sidebar]]
    - [[#org-sidebar][Org Sidebar]]
- [[#modules][Modules]]
  - [[#completion][completion]]
    - [[#company][company]]
    - [[#ivy][ivy]]
  - [[#ui][ui]]
    - [[#doom][Doom]]
    - [[#doom-dashboard][Doom Dashboard]]
    - [[#modeline][Modeline]]
    - [[#fixme-popup][FIXME Popup]]
    - [[#deprecated-tabs][DEPRECATED Tabs]]
    - [[#treemacs][Treemacs]]
  - [[#tools][tools]]
    - [[#debugger][debugger]]
    - [[#magit][Magit]]
  - [[#emacs][emacs]]
    - [[#dired][dired]]
  - [[#term][term]]
    - [[#eshell][eshell]]
  - [[#lang][lang]]
    - [[#org][Org]]
    - [[#go][Go]]
    - [[#python][Python]]
    - [[#latex][LaTeX]]
    - [[#web][Web]]
  - [[#email][email]]
    - [[#mu4e][mu4e]]
  - [[#app][App]]
    - [[#irc][irc]]
    - [[#rss][rss]]
- [[#epilogue][Epilogue]]

* Rudimentary configuration
This is the stuff that does not really belong in any module but is useful
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Jeetaditya Chatterjee"
      user-mail-address "jeetelongname@gmail.com"
      doom-scratch-initial-major-mode 'lisp-interaction-mode
      auth-sources '("~/.authinfo.gpg")
      ispell-dictionary "en"
      display-line-numbers-type 'relative
      browse-url-browser-function 'browse-url-firefox)
#+END_SRC
if a file has changed on disk I dont want that old file sticking around. that
can mess me up
#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode t)
#+END_SRC

Frankly I don't know why this is not default
(it automatically switches to a split)
#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below  t
      evil-vsplit-window-right t)
#+END_SRC

I like a little separation so I put an empty line at the top of my emacs
instance (I may put something in it later)
#+BEGIN_SRC emacs-lisp
(setq-default header-line-format
        (concat (propertize " " 'display '((space :align-to 0)))
                " "))
#+END_SRC
spawn emacs somewhat in the center of my screen
#+BEGIN_SRC emacs-lisp
(let ((width  500)
      (height 250)
      (display-height (display-pixel-height))
      (display-width  (display-pixel-width)))
  (pushnew! initial-frame-alist
            `(left . ,(- (/ display-width 2) (/ width 2)))
            `(top . ,(- (/ display-height 2) (/ height 2)))
            `(width text-pixels ,width)
            `(height text-pixels ,height)))
#+END_SRC
** Quick fixes

** Keybinds
These are my general keybinds they should not belong to any module. thus they
get stuck here
#+BEGIN_SRC emacs-lisp
(map!
 :n "z C-w" 'save-buffer ; I can use this onehanded which is nice when I need to leave or eat or something
 :leader
 :desc "Enable Coloured Values""t c" #'rainbow-mode
 :desc "Toggle Tabs""t B" #'centaur-tabs-local-mode
 :desc "Open Elfeed""o l" #'elfeed


 (:after spell-fu (:map override ;; HACK spell-fu does not define a modemap
                   :n [return]
                   (cmds! (memq 'spell-fu-incorrect-face (face-at-point nil t))
                          #'+spell/correct))))
#+END_SRC

** Hooky hooks
#+begin_src emacs-lisp
(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
;; this snippet can be replaced with `(after! magit (setq magit-save-repository-buffers t))'
;; (after! magit (add-hook! 'magit-status-mode-hook :append (call-interactively #'save-some-buffers)))
#+end_src

#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC
** funky functions
Because this is a literate config I can't re evaluate the buffer using
~eval-buffer~ (bound to =SPC m e b=) so I reload the file
(=m e b= becomes =h r c=)
#+BEGIN_SRC emacs-lisp
(defun yeet/reload ()
  "A simple cmd to make reloading m config easier"
  (interactive)
  (load! "config" doom-private-dir)
  (message "Reloaded!"))

(map! :leader
      "h r c" #'yeet/reload)
#+END_SRC

This was the begining of a paint intergration so that I could draw-in notes. I
could not find a program featurefull yet commandline enough to get it working, but
one day
#+BEGIN_SRC emacs-lisp
(defvar yeet/paint-insert-prefix-dir (concat org-directory "pictures")
  "where to put the picture")
(defvar yeet/paint-ask t
  "Ask if you want to name the file if no it will be named you current buffer + picture")
(defvar yeet/paint-cmd "gnome-paint"
  "the program you want to use as your paint program")

(defun yeet/paint-insert()
  ""
  (interactive)
  (shell-command yeet/paint-cmd))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(defun henlo ()
  "henlo."
  (interactive)
  (message "\"henlo\""))
(henlo)
#+END_SRC

I don't have a problem ok I can =M-x stop= at any time
#+begin_src emacs-lisp
(defun stop ()
  (interactive)
  (defvar name "*I can quit at any time*")
  (switch-to-buffer (get-buffer-create name))
  (insert "I can stop at any time\nI am in control"))
#+end_src


This snippet toggles between a vertical and horizontal window. Like most things
I did not write this I took it from [[https://www.emacswiki.org/emacs/ToggleWindowSplit][here]]
#+begin_src emacs-lisp
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
	     (next-win-buffer (window-buffer (next-window)))
	     (this-win-edges (window-edges (selected-window)))
	     (next-win-edges (window-edges (next-window)))
	     (this-win-2nd (not (and (<= (car this-win-edges)
					 (car next-win-edges))
				     (<= (cadr this-win-edges)
					 (cadr next-win-edges)))))
	     (splitter
	      (if (= (car this-win-edges)
		     (car (window-edges (next-window))))
		  'split-window-horizontally
		'split-window-vertically)))
	(delete-other-windows)
	(let ((first-win (selected-window)))
	  (funcall splitter)
	  (if this-win-2nd (other-window 1))
	  (set-window-buffer (selected-window) this-win-buffer)
	  (set-window-buffer (next-window) next-win-buffer)
	  (select-window first-win)
	  (if this-win-2nd (other-window 1))))))
#+end_src

* Packages
I have quite a few packages that I use. These are the packages and there
subsequent configurations
A nice little header
#+BEGIN_SRC emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+END_SRC
** Language edditions
*** Caddy
#+begin_src emacs-lisp :tangle packages.el
(package! caddyfile-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! caddyfile-mode
  :mode (("Caddyfile\\'" . caddyfile-mode)
         ("caddy\\.conf\\'" . caddyfile-mode)))
#+end_src
*** vim
because sacrilege is fun
(this is mostly a mental exercise but it does work...) I can (alleged) also get lsp
support as well so this may be a fun project to take on
#+begin_src emacs-lisp :tangle packages.el
(package! vimrc-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! vimrc-mode
  :mode "\\.vim\\'"
  :config
  (sp-with-modes 'vimrc-mode
    (sp-local-pair "\"" :action nil)))
#+end_src

** Package edditons
*** Hugo support
This is mostly just for the time stamp but it does come in handy
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! emacs-easy-hugo
  :recipe (:host github
           :repo "masasam/emacs-easy-hugo"
           :files ("*el")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (setq easy-hugo-basedir "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/")
(use-package! emacs-easy-hugo
  :after markdown
  :config
  (setq easy-hugo-root "~/code/git-repos/mine/jeetelongname.github.io/blog-hugo/"))
#+END_SRC
*** TODO dired previews (peep-dired)
this is meant to give me a preview of the file in dired (or a peep). at the
moment it slows me down so its defered for the time being
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! peep-dired)
#+END_SRC

#+begin_src emacs-lisp
(use-package! peep-dired
  ;; :after dired
  :defer t
  :config
  (setq peep-dired-cleanup-on-disable t)
  (map! (:after dired (:map dired-mode-map
                       :n "j" #'peep-dired-next-file
                       :n "k" #'peep-dired-prev-file
                       :localleader
                       "p" #'peep-dired))))
#+end_src

*** modeline fun
/whats life without a little colour?/
#+begin_src emacs-lisp :tangle packages.el
(package! nyan-mode)
(package! parrot)
#+end_src

#+begin_src emacs-lisp
(use-package! nyan-mode
  :defer t
  :config
  (setq nyan-bar-length 20
        nyan-wavy-trail t))

(use-package! parrot
  :defer t
  :config
  (parrot-set-parrot-type 'rotating))
;; (defvar birds '('default 'confused 'emacs 'nyan 'rotating 'science 'thumbsup)) ; FIXME
;; (parrot-set-parrot-type (nth (random (length birds)) birds)))


(after! doom-modeline
  (nyan-mode)
  (nyan-start-animation)
  (parrot-mode)
  (parrot-start-animation))
#+end_src

*** Evil tutor
I wanted to see the differences with its vim counterparts
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! evil-tutor)
#+END_SRC
