config/emacs/doom/config.org
*** discord rich presence
I use discord emacs over elcord .. well because I found it first this is pretty
much all that is needed for it to work and you can use the default client id to
get it working right away or if you want to roll your own .you can add assets by
calling them the file extension (go for golang py for python org for .. well you
know)

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! discord-emacs
  :recipe (:host github
           :repo "nitros12/discord-emacs.el"
           :files ("*.el")))
#+END_SRC

I use non daemon sessions for testing I would much rather it would not be used
(and block the closing of emacs)
#+BEGIN_SRC emacs-lisp
(when (daemonp)
  (use-package! discord-emacs ;; for face value discord intergration
    :config
    ;; (discord-emacs-run "747913611426529440") ;;mine
    (discord-emacs-run "384815451978334208"))) ;;default
#+END_SRC
*** org super agenda
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! origami)
;; (package! org-super-agenda)
#+END_SRC

*** elfeed-goodies
I needed elfeed to look a little nicer. so I got elfeed goodies which did the job
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! elfeed-goodies)
(package! elfeed-web)
#+END_SRC
*** dired drag and drop
I want drag and drop so I just wrapped dragon in elisp the drag commands work
wellish
#+begin_src emacs-lisp :tangle packages.el
;; (package! dired-dragon :recipe (:local-repo "~/code/elisp/dired-dragon"))
(package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"))
#+end_src
#+begin_src emacs-lisp
(use-package! dired-dragon
  :after dired
  :config
  (map! :map dired-mode-map
        (:prefix "C-s"
         :n "d" #'dired-dragon
         :n "s" #'dired-dragon-stay
         :n "i" #'dired-dragon-individual)))
#+end_src

*** themes
this was for a terminal  experiment that did not work
#+begin_src emacs-lisp :tangle packages.el
(package! horizon-theme)
(unpin! doom-themes)
#+end_src


#+begin_src emacs-lisp :tangle packages.el
(package! rose-pine-emacs :recipe (:host github :repo "Caelie/rose-pine-emacs"))
#+end_src
** Outside Influence
*** tldr integration
Ever wanted to.. not read a man page? me too. tldr is a good middle ground between
a lot of useless information and .. no information. Now in emacs!
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! tldr)
#+END_SRC

#+begin_src emacs-lisp
(use-package! tldr
  :config
  (setq tldr-directory-path (expand-file-name "tldr/" doom-etc-dir))
  (setq tldr-enabled-categories '("common" "linux")))
#+end_src
*** atomic chrome
#+begin_src emacs-lisp :tangle packages.el
(package! atomic-chrome)
#+end_src
When writing a lot of markdown on github this helps (now all I need to do is get the
button on a keybind in my browser)
#+begin_src emacs-lisp
(use-package! atomic-chrome
  :after-call focus-out-hook
  :config
  (setq atomic-chrome-buffer-open-style 'frame
        atomic-chrome-default-major-mode 'markdown-mode
        atomic-chrome-url-major-mode-alist
        '(("github.\\.com" . gfm-mode)
          ("reddit\\.com" . fundamental-mode)))

  (atomic-chrome-start-server))
#+end_src
*** emacs application framework
eaf is an application framework for writing pyqt applications in emacs. Its
really cool!
https://github.com/MatthewZMD/.emacs.d#orgad36696 this is a config I need to revisit
You need a few dependencies for this to work. I don't recommend installing from
pip as it can be buggy

#+begin_src shell :tangle no
sudo apt-get install python3-pyqt5.qtwebengine python3-pyqt5.qtmultimedia
#+end_src

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! eaf :recipe
  (:host github
   :repo "manateelazycat/emacs-application-framework"
   :files ("*.el" "*.py" "core" "app")
   :build (:not compile)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package! eaf
  :defer t
  :config
  ;; (setq eaf-enable-debug t) ; should only be used when eaf is wigging out
  (eaf-setq eaf-browser-dark-mode "false") ; dark mode is overrated
  (setq eaf-browser-default-search-engine "duckduckgo")
  (eaf-setq eaf-browse-blank-page-url "https://duckduckgo.com"))

(use-package! eaf-evil ;; evil bindings in my browser
  :after eaf
  :config
  (setq eaf-evil-leader-keymap doom-leader-map)
  (setq eaf-evil-leader-key "SPC"))
#+END_SRC
*** pretty code shots
I missed the ability to make pretty code shots inside vscode now its come back to
me through this package. its pretty cool and works well (it only does one thing)
#+begin_src emacs-lisp :tangle packages.el
(package! carbon-now-sh)
#+end_src

I wanted to work with these code images directly in emacs so I brought in eaf to
help. Do note that there is a bug in the pypi version of the qtwebengine that
basically segfaults if you open carbon (and probably other sites) if you install
from the repos tho this problem goes away
#+begin_src emacs-lisp
(use-package! carbon-now-sh
  :config
  (defun yeet/carbon-use-eaf ()
    (interactive)
    (split-window-right)
    (let ((browse-url-browser-function 'eaf-open-browser))
      (browse-url (concat carbon-now-sh-baseurl "?code="
                          (url-hexify-string (carbon-now-sh--region))))))
  (map! :n "g C-c" #'yeet/carbon-use-eaf))
#+end_src

*** matrix
#+begin_src emacs-lisp :tangle packages.el
;; (package! matrix-client.el :recipe (:host github :repo "alphapapa/matrix-client.el"))
#+end_src

#+end_src
** fun!
*** TODO keycast
I have stolen this from @tecosaur again..
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! keycast)
#+END_SRC
it adds prettier keycast mode support and more stuff that I don't understand. I
also bound it
#+BEGIN_SRC emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :after doom-modeline
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast-mode-line-update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast-mode-line-update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    '(keycast-command :inherit doom-modeline-debug
                      :height 0.9)
    '(keycast-key :inherit custom-modified
                  :height 1.1
                  :weight bold))
  (map! :leader "tk" #'keycast-mode))
#+END_SRC
*** selectric-mode
I want to annoy people with a loud keyboard without having to carry around a
loud keyboard
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! selectric-mode)
#+END_SRC
*** Games
I want to make a module full of fun games and additins to eastr eggs. its there
to document what exists and just add a little more fun to the operating system
we call home
Some games I will probably add
 - https://web.archive.org/web/20070708044037/http://cedet.sourceforge.net/ftp/hangman.el-0.1.gz
 - https://www.emacswiki.org/emacs/CategoryGames
#+begin_src emacs-lisp :tangle packages.el
;; (package! emacs-2048
;;   :recipe (:host github
;;            :repo "sprang/emacs-2048"))

#+end_src
*** snow
#+begin_src emacs-lisp :tangle packages.el
(package! snow)
#+end_src

#+begin_src emacs-lisp
(use-package! snow
  :config
  (set-popup-rule! "^\\*snow\\*$" :ignore t :modeline nil)) ;; FIXME does not work
#+end_src

** TODO Sidebars
By virtue of these things I seem to have 3 different sidebars (4 if you include
treemacs) that I have taken a liking to so they get there own sub genre

#+begin_src emacs-lisp
(defun yeet/sidebar ()
  "Wrappoer for multiple sidebars
there will be more..."
  (interactive)
  (require 'dired-sidebar)
  (require 'ibuffer-sidebar)
  (ibuffer-sidebar-toggle-sidebar)
  (dired-sidebar-toggle-sidebar)) ;; order matters
#+end_src
*** Dired sidebar
this is a replacement for treemacs. Now don't get me wrong. I like treemacs. Its
great but its /not dired/. This preserves a lot of the dired configuration I could
do and more importantly preserves keys which is nice
#+begin_src emacs-lisp :tangle packages.el
(package! dired-sidebar)
#+end_src
#+begin_src emacs-lisp
(after! dired (add-hook! 'dired-sidebar-mode-hook (doom-modeline-mode -1)))

(use-package dired-sidebar
  :defer t
  :config
  (setq dired-sidebar-use-custom-modeline t
        dired-sidebar-should-follow-file t))
(map! :leader "o p" nil :leader "o p" #'yeet/sidebar)
#+end_src
*** Ibuffer sidebar
this is the same thing as above made by the same [[https://github.com/jojojames][author]] and it works just like
dired sidebar.. for Ibuffer
#+begin_src emacs-lisp :tangle packages.el
(package! ibuffer-sidebar)
#+end_src

#+begin_src emacs-lisp
(use-package! ibuffer-sidebar
  :defer t)
#+end_src
*** Org Sidebar
this does a bunch of org stuff like break stuff down into headings. there is a
bit of work to be done
#+begin_src emacs-lisp :tangle packages.el
(package! org-sidebar)
#+end_src

#+begin_src emacs-lisp
(use-package! org-sidebar
  :after org)
#+end_src

* Modules
These are the configurations for the doom specific modules. some are big like
mu4e, some are small like dired. some are well sized. They are all loved tho!
** completion
*** company
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0.7 ; I like my autocomplete like my tea fast not oftern but still there
        ;; company-minimum-prefix-length 2
        company-show-numbers t))
#+END_SRC
*** ivy
#+BEGIN_SRC emacs-lisp
(after! ivy
  (setq ivy-height 20
        ivy-wrap nil
        ivy-magic-slash-non-match-action t)
  (add-to-list 'ivy-re-builders-alist '(counsel-projectile-find-file . ivy--regex-plus)))
#+END_SRC

this is to make prescient a little more intelligent
#+BEGIN_SRC emacs-lisp
(setq-default history-length 10000)
(setq-default prescient-history-length 10000)
#+END_SRC

** ui
*** Doom
This is the main module to say what Doom looks like! I put all of my font
settings and all of that fun stuff here

+Inconsolata is the best font that *I* have used... but it does not italic well.+
+if you do know of a better way. do get in touch!+

Iosevka is my new best friend

#+BEGIN_SRC emacs-lisp
(setq! doom-font
       (font-spec :family "Iosevka" :size 16)
       doom-big-font
       (font-spec :family "Iosevka" :size 25)
       doom-variable-pitch-font
       (font-spec :family "LibreBaskerville" :size 17))
#+end_src

the comments for horizon are borderline unreadable so now we have brighter
comments
#+begin_src emacs-lisp
(after! doom-themes
  (setq! doom-themes-enable-bold t
         doom-themes-enable-italic t
         doom-horizon-brighter-comments t))
#+end_src

I wanted my comments and keywords to be italics. I may need to change fonts..
#+begin_src  emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC

My theme
this will load up 2 different themes one for the terminal and one for the gui.
turns out that the emacs client works differently so this is not something that
I can use...
#+BEGIN_SRC emacs-lisp
;; (require 'rose-pine-theme-moon)
(if (not (daemonp))
    (if (not (display-graphic-p))
        (setq doom-theme 'horizon)
      (setq doom-theme 'doom-horizon))
  (setq doom-theme 'doom-horizon))
#+end_src

