config/emacs/doom/config.org
*** Doom Dashboard

now this is my fancy splash image I need to move over to
#+BEGIN_SRC emacs-lisp
(setq fancy-splash-image (concat doom-private-dir "icons/emacs-icon.png"))
#+END_SRC

I am starting to experimenting with adding stuff to the dashboard
#+begin_src emacs-lisp
(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Get back to work")))
#+end_src

*** Modeline
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-file-name-style 'auto
        doom-modeline-height 30
        doom-modeline-icon 't
        doom-modeline-modal-icon 'nil
        doom-modeline-env-version t
        doom-modeline-buffer-modification-icon t
        doom-modeline-enable-word-count t
        doom-modeline-continuous-word-count-modes '(text-mode)
        doom-modeline-icon (display-graphic-p)
        doom-modeline-persp-name t
        doom-modeline-persp-icon t
        doom-modeline-github t
        doom-modeline-mu4e t))
#+END_SRC
This was all for a little padding. I could remove the stuff I don't need but
whats the fun in that?

#+begin_src emacs-lisp
(after! doom-modeline
  (doom-modeline-def-modeline 'main
    '(bar workspace-name window-number modals matches buffer-info remote-host buffer-position word-count parrot selection-info)
    '(objed-state misc-info persp-name grip irc mu4e github debug repl lsp minor-modes input-method indent-info buffer-encoding major-mode process checker vcs "  " bar)))
#+end_src

I stole this from @tecosaur Its frankly a great addition (this is a theme
throughout @tecosaurs config)
As we expect that the encoding is UTF-8 we remove it from the modeline untill we
get something that is not normal
#+BEGIN_SRC emacs-lisp

(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook! 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

#+END_SRC

the persp name was too dark for my liking
#+begin_src emacs-lisp
(custom-set-faces! '(doom-modeline-persp-name :foreground "#e95678" :weight bold ))
#+end_src
*** FIXME Popup
this is my default pop up rule, all my popups are beaten into submission
#+BEGIN_SRC emacs-lisp
;; (set-popup-rule! ".+"
;;   :side 'right
;;   :width 90
;;   :actions '+popup-display-buffer-stacked-side-window-fn
;;   :quit t)
;; (set-popup-rule! "COMMIT_EDITMSG"
;;   :side 'top
;;   :height 20)
#+END_SRC

*** DEPRECATED Tabs
I don't use tabs so a lot of this is not really maintained...
#+BEGIN_SRC emacs-lisp
(when (featurep! :ui tabs)
  (after! centaur-tabs
    (setq centaur-tabs-style "box"
          centaur-tabs-height 32
          centaur-tabs-set-bar 'under
          x-underline-at-descent-line t
          centaur-tabs-close-button "Ã—"
          centaur-tabs-modified-marker "Ã˜")))
#+END_SRC
*** Treemacs
this provides a vscode like sidebar. I actually use dired a lot more but I guess
its still useful for presentation's
#+BEGIN_SRC emacs-lisp
(after! treemacs
  (setq +treemacs-git-mode 'extended
        treemacs-width 30))
#+END_SRC
** tools
*** TODO debugger
dap support in doom is meh so I a have added a little more. tbh I don't really
use a debugger (tho I should) its a little broken and go support seems to be
out so I will have to fix that eventually
#+begin_src emacs-lisp
(after! dap-mode
  (setq dap-auto-configure-features '(sessions locals controls tooltip)
        dap-python-executable "python3"))
#+end_src

this does a thing
#+begin_src emacs-lisp
(add-hook 'dap-stopped-hook
          (lambda () (call-interactively #'dap-hydra)))
#+end_src
#+begin_src emacs-lisp
(map! :leader "od" nil
      :leader "od" #'dap-debug
      :leader "dt" #'dap-breakpoint-toggle)
#+end_src
*** Magit
** emacs
*** dired
If I open 2 instances of dired in two different locations then move one. dired
will point the move to the other location
#+begin_src emacs-lisp
(setq dired-dwim-target t)
#+end_src
** term
*** eshell
eshell is a repl like shell. it works like a shell but you can use elisp in line
and it does not handle tui apps (like htop) usually defering to ~ansi-term~
#+begin_src emacs-lisp
(set-eshell-alias!
 "cls" "clear")
#+end_src

** lang
*** TODO Org
Org mode. our favorite plain text markup format! these are my configurations for
it
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org-notes/")
(after! org
  (setq
        org-agenda-files (list org-directory)
        org-hide-emphasis-markers t)

  (when (featurep! :lang org +pretty) ;; I used to use the +pretty flag but I now don't thus the `when'
    (setq org-fancy-priorities-list '("âš¡" "â¬†" "â¬‡" "â˜•")
          org-superstar-headline-bullets-list '("â•" "Ü…" "â–" "â˜" "â™" "âœ"))))
#+end_src

As org has a lot of subheading's I wanted to tweak stuff ever so slightly thus
here we are. do note that I have copied all of the foreground info over that
becuse the ~inherit~ value (setter?, key? idk) did not exist untill I looked it
up it would have looked like ~..:inherit outline-x~ where x is the level of the
heading you want to change. This just locks me into the horizon colour scheme
but there are worst things. The better way would be to change ~outline-x~
directly
#+begin_src emacs-lisp
(custom-set-faces!
  '(org-date :foreground "#5b6268")
  '(org-document-title :height 1.75 :weight bold)
  '(org-level-1 :foreground "#21bfc2" :height 1.3 :weight normal)
  '(org-level-2 :foreground "#6c6f93" :height 1.1 :weight normal)
  '(org-level-3 :foreground "#b877db" :height 1.0 :weight normal)
  '(org-level-4 :foreground "#58cfd1":height 1.0 :weight normal)
  '(org-level-5 :foreground "#9093ae":weight normal)
  '(org-level-6 :foreground "#90dfe0":weight normal))
  #+END_SRC


#+BEGIN_SRC emacs-lisp
(after! org-capture
    (setq org-capture-templates
      '(("x" "Note" entry (file+olp+datetree "journal.org") "**** %T %?" :prepend t :kill-buffer t)
        ("t" "Task" entry (file+headline "tasks.org" "Inbox") "**** TODO %U %?\n%i" :prepend t :kill-buffer t)
        ("b" "Blog" entry (file+headline "blog-ideas.org" "Ideas") "**** TODO  %?\n%i" :prepend t :kill-buffer t)
        ("U" "UTCR" entry (file+headline "UTCR-TODO.org" "Tasks") "**** TODO %?\n%i" :prepend t :kill-buffer t))))
#+END_SRC
**** Roam
#+begin_src emacs-lisp
(setq org-roam-directory (concat org-directory "roam/")
      org-roam-db-location (concat org-roam-directory ".org-roam.db"))
#+end_src
*** Go
Go and lsp have not been behaving like they should. the file watchers have been
misbehaving and now they have been disabled for go mode. That fixes the issue
but means lsp will not watch files in the workspace (a small price to pay imo)
#+BEGIN_SRC emacs-lisp
(after! go-mode ;; I have stopped using ligatures so this is not useful to me but it can be to you!
  (set-ligatures! 'go-mode
                  :def "func"
                  :true "true" :false "false"
                  :int "int" :str "string"
                  :float "float" :bool "bool"
                  :for "for"
                  :return "return" )
  )
(setq-hook! 'go-mode-hook
  lsp-enable-file-watchers nil)
#+END_SRC
*** Python
Python is great is it not ðŸ
#+BEGIN_SRC emacs-lisp
(setq! +python-ipython-command '("ipython3" "-i" "--simple-prompt" "--no-color-info"))
(set-repl-handler! 'python-mode #'+python/open-ipython-repl)
#+END_SRC

*** LaTeX
turns out doom has support for latexmk already
#+BEGIN_SRC emacs-lisp
(setq +latex-viewers '(pdf-tools))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(map! :map cdlatex-mode-map
      :i "TAB" #'cdlatex-tab)
#+END_SRC
*** TODO Web
I just find the tidy formatter indent functionality annoying and redundant. so
I changed it
#+begin_src emacs-lisp
(setenv "HTML_TIDY" (expand-file-name "tidy.conf" doom-private-dir))
(setq +format-on-save-enabled-modes
      '(not web-mode))
#+end_src

#+begin_src conf :tangle tidy.conf
indent: no  
indent-spaces: 4
gnu-emacs: yes
#+end_src
** email
